W5D1/goalz/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "tk2"], ["created_at", "2017-08-28 20:35:46.340651"], ["updated_at", "2017-08-28 20:35:46.340651"]]