W4D1/routes_controllers/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "\"ASDF\""], ["image_url", "\"FAKE_IMAGE\""], ["artist_id", 35]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save!