W4D1/routes_controllers/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 6], ["viewer_id", 37]]

  def index
    @artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"