W4D1/routes_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Betty"], ["email", "bettyl@gmail.com"], ["created_at", "2017-08-21 21:31:54.695823"], ["updated_at", "2017-08-21 21:31:54.695823"]]
---
  def create
    user = User.new(user_params)
    if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Betty"], ["email", "bettyl@gmail.com"], ["updated_at", "2017-08-21 21:41:22.579637"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params) && @user.save!